Repository: NMarjou/localization-app
Catalog: TMs/en-US_th-TH.tmx
Source language: en_us
Languages: th_th

source: Connection ID
th_th: รหัสการเชื่อมต่อ

source: Round ID
th_th: รหัสรอบ

source: Round Management
th_th: การจัดการรอบ

source: Copy JSON
th_th: คัดลอก JSON

source: Failed to copy. Please try again.
th_th: คัดลอกไม่สำเร็จ โปรดลองอีกครั้ง

source: JSON copied to clipboard
th_th: คัดลอก JSON ไปยังคลิปบอร์ดแล้ว

source: Create statement generation rule
th_th: สร้างกฎการสร้างรายการเดินบัญชี

source: The statement generation rule was successfully created.
th_th: สร้างกฎการสร้างรายงานสำเร็จแล้ว

source: Are you sure you want to delete this statement generation rule? This action cannot be undone.
th_th: คุณแน่ใจหรือว่าต้องการลบกฎการสร้าง statement นี้? การดำเนินการนี้ไม่สามารถย้อนกลับได้

source: The statement generation rule was successfully duplicated.
th_th: กฎการสร้างรายงานถูกคัดลอกเรียบร้อยแล้ว

source: No statement generation rules yet!
th_th: ยังไม่มีข้อกำหนดในการสร้างข้อความ!

source: Generated
th_th: สร้างขึ้น

source: Generation failed
th_th: การสร้างล้มเหลว

source: Not generated
th_th: ไม่ได้สร้างขึ้น

source: The communication round cannot be empty.
th_th: รอบการสื่อสารต้องไม่เว้นว่าง

source: Specify a name and a description for this document distribution rule.
th_th: โปรดระบุชื่อและคำอธิบายสำหรับกฎการแจกจ่ายเอกสารนี้

source: Distribution rules
th_th: กฎการแจกจ่าย

source: Select the communication round and document template that will be used for distribution.
th_th: เลือกช่วงการสื่อสารและแม่แบบเอกสารที่จะใช้สำหรับการแจกจ่าย

source: Edit statement generation rule
th_th: แก้ไขกฎการสร้างรายงานบัญชี

source: The file name cannot be longer than {{charLimit}} characters.
th_th: ชื่อไฟล์ต้องไม่ยาวเกิน {{charLimit}} อักขระ

source: Customize the file name with variables
th_th: ปรับแต่งชื่อไฟล์ด้วยตัวแปร

source: Use a fixed file name for all documents
th_th: ใช้ชื่อไฟล์คงที่สำหรับเอกสารทั้งหมด

source: The file name cannot contain special characters.
th_th: ชื่อไฟล์ต้องไม่มีอักขระพิเศษ

source: The document template cannot be empty.
th_th: แม่แบบเอกสารต้องไม่เว้นว่าง

source: Select document template
th_th: เลือกแม่แบบเอกสาร

source: The statement generation has started.
th_th: การสร้างรายงานได้เริ่มต้นแล้ว

source: The statement generation rule was successfully updated.
th_th: กฎการสร้างคำชี้แจงได้รับการอัปเดตเรียบร้อยแล้ว

source: View statement generation rule
th_th: ดูหลักเกณฑ์การสร้างสเตทเมนต์

source: Manage round cycle
th_th: จัดการรอบการทำงาน

source: Round name (A-Z)
th_th: ชื่อรอบ (A-Z)

source: Round name (Z-A)
th_th: ชื่อรอบ (Z-A)

source: Sorting
th_th: การจัดเรียง

source: Start date (earliest)
th_th: วันที่เริ่มต้น (เร็วที่สุด)

source: Start date (latest)
th_th: วันที่เริ่มต้น (ล่าสุด)

source: Actual budget
th_th: งบประมาณที่แท้จริง

source: No maximum outcome configuration
th_th: ไม่มีการกำหนดค่าผลลัพธ์สูงสุด

source: No minimum outcome configuration
th_th: ไม่มีการกำหนดค่าผลลัพธ์ขั้นต่ำ

source: No outcome configuration
th_th: ไม่มีการกำหนดค่าผลลัพธ์

source: No rule configuration
th_th: ไม่มีการกำหนดค่ากฎ

source: No validation reports with the name "{{phrase}}"
th_th: ไม่มีรายงานการประเมินผลงานที่มีชื่อว่า " {{phrase}} "

source: The note was successfully deleted.
th_th: ลบหมายเหตุสำเร็จแล้ว

source: Select rule
th_th: เลือกกฎ

source: Total eligible workers
th_th: รวมคนงานที่มีสิทธิ์

source: Total populations
th_th: จำนวนประชากรทั้งหมด

source: Total number of rules
th_th: จำนวนกฎทั้งหมด

source: Incentive Management
th_th: การจัดการแรงจูงใจ

source: Select at least one data source to continue.
th_th: โปรดเลือกแหล่งข้อมูลอย่างน้อยหนึ่งรายการเพื่อดำเนินการต่อ

source: Manage the round cycle to generate statements and create payroll connections.
th_th: จัดการรอบวัฏจักรเพื่อสร้างรายการและเชื่อมต่อกับระบบเงินเดือน

source: Incentive Curve Design
th_th: การออกแบบเส้นโค้งแรงจูงใจ

source: Compensation Structure
th_th: โครงสร้างค่าตอบแทน

source: Compensation Process
th_th: กระบวนการชดเชย

source: Create your organization's compensation framework and comp elements, including salary, allowances, per diems, bonus, deferrals, equity, and indirect benefits/allowances.
th_th: สร้างกรอบการจ่ายผลตอบแทนและองค์ประกอบผลตอบแทนขององค์กรของคุณ ได้แก่ เงินเดือน เงินสมทบ ค่าเบี้ยเลี้ยง โบนัส รายการตัดจ่าย หุ้น และผลประโยชน์/ค่าตอบแทนทางอ้อม

source: Active currencies
th_th: สกุลเงินที่ใช้งานอยู่

source: Enabled currencies
th_th: สกุลเงินที่เปิดใช้งาน

source: Is enabled
th_th: เปิดใช้งานแล้ว

source: {{currencyName}} currency is active
th_th: สกุลเงิน {{currencyName}} กำลังใช้งานอยู่

source: No currencies yet
th_th: ยังไม่มีสกุลเงิน

source: Company currency
th_th: สกุลเงินของบริษัท

source: Global currency checkbox for {{currencyName}}
th_th: ช่องทำเครื่องหมายสกุลเงินทั่วโลกสำหรับ {{currencyName}}

source: No currencies with the name "{{phrase}}"
th_th: ไม่พบสกุลเงินที่มีชื่อว่า "{{phrase}}"

source: Selected currency checkbox for {{currencyName}}
th_th: ช่องทำเครื่องหมายสกุลเงินที่เลือกสำหรับ {{currencyName}}

source: Selected currency checkbox for this page
th_th: ช่องทำเครื่องหมายสกุลเงินที่เลือกสำหรับหน้านี้

source: Enable the currencies that users will be able to select on the platform. The global currency cannot be selected or deactivated.
th_th: เปิดใช้งานสกุลเงินที่ผู้ใช้จะสามารถเลือกได้บนแพลตฟอร์ม สกุลเงินหลักไม่สามารถเลือกหรือปิดใช้งานได้

source: Currency preview
th_th: ดูตัวอย่างสกุลเงิน

source: Global currency
th_th: สกุลเงินสากล

source: Change global currency
th_th: เปลี่ยนสกุลเงินทั่วโลก

source: Select the default currency for all users across the application.
th_th: เลือกสกุลเงินเริ่มต้นสำหรับผู้ใช้ทุกคนในแอปพลิเคชัน

source: The previous currency will remain enabled. If you no longer need it, please disable it manually in the currency table.
th_th: สกุลเงินเดิมจะยังคงเปิดใช้งานอยู่ หากท่านไม่ต้องการใช้งานอีกต่อไป กรุณาปิดการใช้งานด้วยตนเองในตารางสกุลเงิน

source: The selected global currency will be used as the default one across the application and will be automatically enabled.
th_th: สกุลเงินสากลที่เลือกจะถูกใช้เป็นค่าเริ่มต้นทั่วทั้งแอปพลิเคชันและจะเปิดใช้งานโดยอัตโนมัติ

source: Global currency configuration
th_th: การกำหนดค่าสกุลเงินทั่วโลก

source: Currencies & Exchange Rates
th_th: สกุลเงินและอัตราแลกเปลี่ยน

source: Define which currencies will be available across the application features and which one will be global currency.
th_th: กำหนดว่าสกุลเงินใดจะสามารถใช้งานได้ในแต่ละฟีเจอร์ของแอปพลิเคชัน และสกุลเงินใดจะเป็นสกุลเงินหลัก

source: Active & global currencies
th_th: สกุลเงินที่ใช้งานอยู่และสกุลเงินทั่วโลก

source: The configuration for currency settings was modified. Saving these changes will impact future snapshots and related data.
th_th: การตั้งค่าสำหรับสกุลเงินถูกแก้ไข การบันทึกการเปลี่ยนแปลงนี้จะมีผลต่อสแนปช็อตและข้อมูลที่เกี่ยวข้องในอนาคต

source: Configuration change detected
th_th: ตรวจพบการเปลี่ยนแปลงการกำหนดค่า

source: Currency Settings
th_th: การตั้งค่าสกุลเงิน

source: The name is required.
th_th: ต้องระบุชื่อ

source: Payout curve details
th_th: รายละเอียดของเส้นโค้งการจ่ายเงิน

source: The code already exists
th_th: มีรหัสอยู่แล้ว

source: Enter a code for the payout curve
th_th: ป้อนรหัสสำหรับเส้นโค้งการจ่ายเงิน

source: Enter the basic information of the payout curve
th_th: กรอกข้อมูลพื้นฐานของเส้นโค้งการจ่ายเงิน

source: Enter a description for the payout curve
th_th: โปรดใส่คำอธิบายสำหรับเส้นโค้งการจ่ายเงิน

source: Enter a name for the payout curve
th_th: ป้อนชื่อสำหรับเส้นโค้งการจ่ายเงิน

source: Falling
th_th: กำลังตก

source: Decreasing payout over time/levels.
th_th: การจ่ายเงินรางวัลลดลงตามเวลา/ระดับ

source: Growing
th_th: กำลังเติบโต

source: Increasing payout over time/levels.
th_th: การจ่ายเงินรางวัลที่เพิ่มขึ้นตามเวลา/ระดับ

source: Create payout curve
th_th: สร้างเส้นโค้งการจ่ายเงิน

source: Edit payout curve
th_th: แก้ไขเส้นโค้งการจ่ายเงิน

source: Linear curve
th_th: เส้นโค้งเชิงเส้น

source: Payout curves
th_th: เส้นโค้งการจ่ายเงิน

source: No payout curves have been created yet.
th_th: ยังไม่มีการสร้างเส้นโค้งการจ่ายเงิน

source: No payout curves yet
th_th: ยังไม่มีเส้นโค้งการจ่ายเงิน

source: The payout curve was successfully published.
th_th: เผยแพร่เส้นโค้งการจ่ายเงินสำเร็จแล้ว

source: The payout curve was successfully saved.
th_th: เส้นโค้งการจ่ายเงินถูกบันทึกเรียบร้อยแล้ว

source: Your conditions are empty or do not meet the criteria. Please correct the errors to generate the payout curve chart.
th_th: เงื่อนไขของท่านว่างเปล่าหรือไม่ตรงตามเกณฑ์ กรุณาแก้ไขข้อผิดพลาดเพื่อสร้างกราฟเส้นการจ่ายเงิน

source: Cannot generate chart
th_th: ไม่สามารถสร้างแผนภูมิได้

source: Payout curve preview
th_th: ตัวอย่างเส้นโค้งการจ่ายเงิน

source: Check the correlation between results and payouts, along with a chart illustrating the payout curve.
th_th: ตรวจสอบความสัมพันธ์ระหว่างผลลัพธ์และการจ่ายเงิน พร้อมทั้งแผนภูมิที่แสดงเส้นโค้งการจ่ายเงิน

source: Clear values
th_th: ล้างค่า

source: Direction
th_th: ทิศทาง

source: What is the direction of this curve?
th_th: เส้นโค้งนี้มีทิศทางอย่างไร?

source: Rules related to the selected direction:
th_th: กฎที่เกี่ยวข้องกับทิศทางที่เลือก:

source: Result values must decrease from top to bottom
th_th: ค่าผลลัพธ์ต้องลดลงจากบนลงล่าง

source: Falling curve is suited for scenarios where higher performance results in lower payouts (such as, penalties or cost control).
th_th: เส้นโค้งที่ลดลงเหมาะสำหรับสถานการณ์ที่ผลการปฏิบัติงานสูงขึ้นแต่ได้รับผลตอบแทนลดลง (เช่น กรณีบทลงโทษหรือการควบคุมต้นทุน)

source: Payout values must decrease
th_th: ค่าการจ่ายเงินต้องลดลง

source: Workers whose results are at or below the lowest defined threshold will receive the maximum payout value.
th_th: พนักงานที่มีผลลัพธ์อยู่ที่หรือ ต่ำกว่าค่าขั้นต่ำที่กำหนดไว้ จะได้รับค่าสิทธิประโยชน์สูงสุด

source: Workers whose results exceed the highest defined threshold will receive 0.
th_th: พนักงานที่มีผลลัพธ์เกินกว่าค่าขีดจำกัดสูงสุดที่กำหนดไว้จะได้รับ 0

source: Workers whose results exceed the highest defined threshold will receive the maximum payout value.
th_th: พนักงานที่มีผลการทำงานเกินเกณฑ์สูงสุดที่กำหนดไว้ จะได้รับค่าตอบแทนสูงสุด

source: Workers whose results are below the lowest defined threshold will receive 0.
th_th: พนักงานที่มีผลลัพธ์ต่ำกว่าค่าขั้นต่ำที่กำหนดไว้จะได้รับ 0

source: General rules:
th_th: กฎทั่วไป:

source: Enter whole numbers and decimals in the input fields (fractions are not allowed).
th_th: กรุณากรอกตัวเลขจำนวนเต็มและทศนิยมในช่องกรอกข้อมูล (ไม่อนุญาตให้ใช้เศษส่วน)

source: In a growing curve, each result condition must be higher than the one before it.
th_th: ในกราฟที่มีแนวโน้มเพิ่มขึ้น เงื่อนไขผลลัพธ์แต่ละข้อจะต้องสูงกว่าข้อก่อนหน้า

source: This configuration is typically used when better performance results in higher payouts.
th_th: การกำหนดค่านี้มักใช้เมื่อประสิทธิภาพที่ดีกว่าส่งผลให้ได้รับผลตอบแทนที่สูงขึ้น

source: Corresponding payout values should also increase or remain the same as performance improves.
th_th: ค่าตอบแทนที่เกี่ยวข้องควรเพิ่มขึ้นหรือคงเดิมเมื่อประสิทธิภาพดีขึ้น

source: Rules & guidelines
th_th: กฎและแนวทางปฏิบัติ

source: Thresholds
th_th: เกณฑ์กำหนด

source: Define performance milestones and their corresponding payout levels.
th_th: กำหนดเป้าหมายประสิทธิภาพและระดับการจ่ายผลตอบแทนที่สอดคล้องกัน

source: What type is your payout curve?
th_th: เส้นโค้งการจ่ายเงินของคุณเป็นประเภทใด?

source: Result units
th_th: หน่วยของผลลัพธ์

source: Performance result
th_th: ผลการปฏิบัติงาน

source: Which units will be used for results in this curve?
th_th: หน่วยใดที่จะใช้สำหรับผลลัพธ์ในกราฟนี้?

source: The value must be larger than the {{min}} value.
th_th: ค่าต้องมากกว่าค่าขั้นต่ำ {{min}}

source: Define the min and max values for results and payout.
th_th: กำหนดค่าต่ำสุดและค่าสูงสุดสำหรับผลลัพธ์และการจ่ายเงิน

source: Payout curve settings
th_th: การตั้งค่าเส้นโค้งการจ่ายเงิน

source: The configuration contains issues. Please verify the ranges and conditions to avoid errors.
th_th: การกำหนดค่ามีปัญหา กรุณาตรวจสอบช่วงและเงื่อนไขเพื่อหลีกเลี่ยงข้อผิดพลาด

source: Payout range
th_th: ช่วงการจ่ายเงิน

source: Maximum payout
th_th: การจ่ายเงินสูงสุด

source: Minimum payout
th_th: การจ่ายเงินขั้นต่ำ

source: The maximum value must be larger than the minimum value.
th_th: ค่าสูงสุดต้องมากกว่าค่าต่ำสุด

source: Result range
th_th: ช่วงของผลลัพธ์

source: Maximum result
th_th: ผลลัพธ์สูงสุด

source: Minimum result
th_th: ผลลัพธ์ขั้นต่ำ

source: The highest allowable value for both result and payout ranges is 120%.
th_th: ค่าสูงสุดที่อนุญาตสำหรับทั้งช่วงผลลัพธ์และการจ่ายเงินคือ 120%.

source: The lowest allowable value for both result and payout ranges is 0%.
th_th: ค่าต่ำสุดที่อนุญาตสำหรับทั้งช่วงผลลัพธ์และการจ่ายเงินคือ 0%.

source: All workers that exceed the maximum result will be included in the maximum range.
th_th: พนักงานทุกคนที่เกินผลลัพธ์สูงสุดจะถูกรวมอยู่ในช่วงสูงสุด

source: The input fields accept whole numbers and decimals only. Fractions are not permitted.
th_th: ช่องป้อนข้อมูลยอมรับเฉพาะตัวเลขจำนวนเต็มและทศนิยมเท่านั้น ไม่อนุญาตให้ใช้เศษส่วน

source: The default unit used in the payout curve metric is percentage.
th_th: หน่วยเริ่มต้นที่ใช้ในเมตริกเส้นโค้งการจ่ายเงินคือเปอร์เซ็นต์

source: The value must be smaller than the {{max}} value.
th_th: ค่าต้องน้อยกว่าค่าสูงสุด {{max}}

source: Define metrics, type and thresholds
th_th: กำหนดตัวชี้วัด ประเภท และเกณฑ์

source: End payout
th_th: สิ้นสุดการจ่ายเงิน

source: End result
th_th: ผลลัพธ์สุดท้าย

source: Payout value (%)
th_th: มูลค่าการจ่ายเงิน (%)

source: Payout
th_th: การจ่ายเงิน

source: Payout: {{yAxis}}
th_th: การจ่ายเงิน: {{yAxis}}

source: Result (%)
th_th: ผลลัพธ์ (%)

source: for
th_th: สำหรับ

source: Result: {{xAxis}}
th_th: ผลลัพธ์: {{xAxis}}

source: Start payout
th_th: เริ่มการจ่ายเงิน

source: Start result
th_th: เริ่มผลลัพธ์

source: Step curve
th_th: ขั้นบันได

source: A linear curve represents a payout that changes at a constant rate over time or across performance levels.
th_th: เส้นโค้งเชิงเส้นหมายถึงการจ่ายผลตอบแทนที่เปลี่ยนแปลงในอัตราคงที่เมื่อเวลาผ่านไปหรือในแต่ละระดับของผลการปฏิบัติงาน

source: A step curve changes payout in fixed "jumps" at specified intervals rather than gradually.
th_th: เส้นโค้งแบบขั้นจะเปลี่ยนการจ่ายเงินเป็น "ขั้น" คงที่ในช่วงเวลาที่กำหนด แทนที่จะเปลี่ยนแปลงอย่างค่อยเป็นค่อยไป

source: Amount (units)
th_th: จำนวน (หน่วย)

source: Percentages
th_th: เปอร์เซ็นต์

source: View payout curve
th_th: ดูเส้นโค้งการจ่ายผลตอบแทน

source: Additional field attributes
th_th: คุณลักษณะเพิ่มเติมของฟิลด์

source: Are you sure you want to deactivate entity? This action cannot be undone.
th_th: คุณแน่ใจหรือไม่ว่าต้องการปิดใช้งานเอนทิตี? การดำเนินการนี้ไม่สามารถยกเลิกได้

source: Are you sure you want to delete this entity? This action cannot be undone.
th_th: คุณแน่ใจหรือไม่ว่าต้องการลบเอนทิตีนี้? การดำเนินการนี้ไม่สามารถยกเลิกได้

source: Are you sure you want to publish this entity? We recommend reviewing the entity settings first.
th_th: คุณแน่ใจหรือไม่ว่าต้องการเผยแพร่เอนทิตีนี้ เราแนะนำให้ตรวจสอบการตั้งค่าเอนทิตีก่อน

source: Confirm publishing
th_th: ยืนยันการเผยแพร่

source: Create custom entity
th_th: สร้างเอนทิตีแบบกำหนดเอง

source: Failed to load entity details.
th_th: โหลดรายละเอียดเอนทิตีไม่สำเร็จ

source: Custom entity details
th_th: รายละเอียดเอนทิตีแบบกำหนดเอง

source: Edit custom entity
th_th: แก้ไขเอนทิตีแบบกำหนดเอง

source: Edit {{name}}
th_th: แก้ไข {{name}}

source: Effective dating
th_th: วันที่มีผลบังคับใช้

source: No effective dating
th_th: ไม่มีการกำหนดวันที่มีผลบังคับใช้

source: Effective date range
th_th: ช่วงวันที่มีผลบังคับใช้

source: Try adjusting your search or filters to find what you're looking for.
th_th: ลองปรับการค้นหาหรือฟิลเตอร์ของคุณเพื่อค้นหาสิ่งที่คุณต้องการ

source: No custom entities match your filters
th_th: ไม่มีเอนทิตีแบบกำหนดเองที่ตรงกับตัวกรองของคุณ

source: No custom entities yet
th_th: ยังไม่มีเอนทิตีแบบกำหนดเอง

source: Entity details
th_th: รายละเอียดเอนทิตี

source: At least one field must be set as business key.
th_th: ต้องตั้งค่าอย่างน้อยหนึ่งฟิลด์ให้เป็นคีย์ธุรกิจ

source: At least one field must be configured.
th_th: ต้องกำหนดค่าอย่างน้อยหนึ่งฟิลด์

source: At least one field must be set as required.
th_th: ต้องกำหนดให้มีอย่างน้อยหนึ่งฟิลด์เป็นฟิลด์บังคับ

source: You can add up to {{max}} fields
th_th: คุณสามารถเพิ่มฟิลด์ได้สูงสุด {{max}} ฟิลด์

source: Is business key
th_th: เป็นกุญแจสำคัญทางธุรกิจ

source: Is required
th_th: จำเป็นต้องระบุ

source: Provide a name for the entity
th_th: ระบุชื่อสำหรับเอนทิตี

source: Reference
th_th: การอ้างอิง

source: {{count}} of {{max}}
th_th: {{count}} จาก {{max}}

source: Select reference
th_th: เลือกข้อมูลอ้างอิง

source: Enter a name for the entity
th_th: ป้อนชื่อสำหรับเอนทิตี

source: Build your entity grid by adding fields
th_th: สร้างกริดเอนทิตีของคุณโดยการเพิ่มฟิลด์

source: Grid builder
th_th: ตัวสร้างกริด

source: Custom entities
th_th: เอนทิตีแบบกำหนดเอง

source: Total entities
th_th: เอนทิตีทั้งหมด

source: The custom entity was successfully activated.
th_th: เปิดใช้งานเอนทิตีแบบกำหนดเองเรียบร้อยแล้ว

source: The custom entity was successfully deactivated.
th_th: ปิดใช้งานเอนทิตีที่กำหนดเองเรียบร้อยแล้ว

source: Search for custom entities
th_th: ค้นหาเอนทิตีแบบกำหนดเอง

source: Custom Entities
th_th: เอนทิตีแบบกำหนดเอง

source: Enum reference
th_th: เอกสารอ้างอิง Enum

source: Number
th_th: หมายเลข

source: The field name is required.
th_th: จำเป็นต้องระบุชื่อฟิลด์

source: The reference is required for this type.
th_th: ต้องระบุข้อมูลอ้างอิงสำหรับประเภทนี้

source: The field type is required.
th_th: จำเป็นต้องระบุประเภทของฟิลด์

source: Not defined
th_th: ไม่ได้กำหนด

source: View {{name}}
th_th: ดู {{name}}

source: Field Management
th_th: การจัดการฟิลด์

source: Define the label that indicates which analyses will be updated from PayAnalytics when the refresh action is triggered.
th_th: กำหนดป้ายกำกับที่ระบุว่าการวิเคราะห์ใดจะได้รับการอัปเดตจาก PayAnalytics เมื่อมีการเรียกใช้การรีเฟรช

source: Label name
th_th: ชื่อป้ายกำกับ

source: Analysis refresh configuration
th_th: การกำหนดค่าการรีเฟรชการวิเคราะห์

source: Add mapping to model
th_th: เพิ่มการแมปให้กับโมเดล

source: Add mapping to the model
th_th: เพิ่มการแมปให้กับโมเดล

source: Additional compensation field
th_th: ฟิลด์ค่าตอบแทนเพิ่มเติม

source: Compensation components will be automatically adjusted to full-time using the FTE field.
th_th: องค์ประกอบค่าตอบแทนจะถูกปรับเป็นพนักงานเต็มเวลาโดยอัตโนมัติด้วยการใช้ฟิลด์ FTE

source: Apply part-time scaling
th_th: ใช้การปรับสเกลสำหรับพนักงานพาร์ตไทม์

source: The field for compensation field is required.
th_th: ต้องกรอกช่องข้อมูลค่าตอบแทน

source: Compensation field
th_th: ฟิลด์ค่าตอบแทน

source: Converts all compensation data to the global currency, or to the currency specified below. The default exchange rate and effective date of the data snapshot will be used for the conversion.
th_th: แปลงข้อมูลค่าตอบแทนทั้งหมดเป็นสกุลเงินสากล หรือเป็นสกุลเงินที่ระบุด้านล่าง โดยใช้ อัตราแลกเปลี่ยนค่าเริ่มต้นและวันที่มีผลของสแนปช็อตข้อมูล สำหรับการแปลงนี้

source: Currency conversion
th_th: การแปลงสกุลเงิน

source: The field for currency field is required.
th_th: จำเป็นต้องกรอกฟิลด์สกุลเงิน

source: The field for data model is required.
th_th: จำเป็นต้องกรอกช่องสำหรับโมเดลข้อมูล

source: Select data model
th_th: เลือกแบบจำลองข้อมูล

source: Demographic
th_th: ข้อมูลประชากร

source: Additional demographic variable
th_th: ตัวแปรข้อมูลประชากรเพิ่มเติม

source: For each data model created in data foundation, map the dataset configuration needed to generate a Pay Analysis. Only snapshots using a data model with a mapping can be used to generate pay analysis data sets.
th_th: สำหรับแต่ละโมเดลข้อมูลที่สร้างใน data foundation ให้แมปการกำหนดค่าชุดข้อมูลที่จำเป็นสำหรับการสร้างการวิเคราะห์ค่าตอบแทน (Pay Analysis) เฉพาะสแนปช็อตที่ใช้โมเดลข้อมูลซึ่งมีการแมปแล้วเท่านั้นที่สามารถใช้ในการสร้างชุดข้อมูลการวิเคราะห์ค่าตอบแทนได้

source: Edit mapping to the model
th_th: แก้ไขการจับคู่กับโมเดล

source: The field for worker ID is required.
th_th: ต้องกรอกฟิลด์รหัสพนักงาน

source: Worker ID & group
th_th: รหัสและกลุ่มพนักงาน

source: Get started by adding one.
th_th: เริ่มต้นด้วยการเพิ่มหนึ่งรายการ

source: No models with mapping yet.
th_th: ยังไม่มีโมเดลที่ทำการแมป

source: The field for female is required.
th_th: ต้องระบุข้อมูลในช่องสำหรับเพศหญิง

source: The field for full-time equivalent is required.
th_th: จำเป็นต้องกรอกช่องสำหรับจำนวนพนักงานเทียบเท่าเต็มเวลา

source: Full-time equivalent
th_th: เทียบเท่างานเต็มเวลา

source: The field for gender field is required.
th_th: ต้องกรอกช่องเพศ

source: Gender field
th_th: ช่องเพศ

source: The worker category can be defined when creating the snapshot.
th_th: สามารถกำหนดหมวดหมู่พนักงานได้เมื่อสร้างสแนปชอต

source: Use the worker category from the snapshot as the main group.
th_th: ใช้ประเภทพนักงานจากสแน็ปช็อตเป็นกลุ่มหลัก

source: The field for main currency is required.
th_th: จำเป็นต้องกรอกช่องสกุลเงินหลัก

source: Main currency
th_th: สกุลเงินหลัก

source: The field for main group is required.
th_th: ต้องระบุช่องสำหรับกลุ่มหลัก

source: Main group
th_th: กลุ่มหลัก

source: The field for male is required.
th_th: ต้องกรอกช่องสำหรับผู้ชาย

source: Select a model and configure the mapping for the essential fields.
th_th: เลือกโมเดลและกำหนดค่าการแมปสำหรับฟิลด์ที่จำเป็น

source: Edit mapping
th_th: แก้ไขการจับคู่

source: Non-binary
th_th: ไม่เป็นไบนารี

source: Not reported
th_th: ไม่ได้รายงาน

source: Scaled compensation components
th_th: องค์ประกอบค่าตอบแทนแบบสเกล

source: Additional compensation fields
th_th: ฟิลด์ค่าตอบแทนเพิ่มเติม

source: Part-time scaling
th_th: การปรับสเกลสำหรับพนักงานพาร์ทไทม์

source: Data models with pay analysis mapping
th_th: แบบจำลองข้อมูลพร้อมการแมปการวิเคราะห์ค่าตอบแทน

source: View mapping to the model
th_th: ดูการแมปกับโมเดล

source: The dataset mapping configuration was successfully saved.
th_th: บันทึกการกำหนดค่าการแมปชุดข้อมูลเรียบร้อยแล้ว

source: You haven't added any features yet.
th_th: คุณยังไม่ได้เพิ่มฟีเจอร์ใด ๆ เลย

source: Select field
th_th: เลือกฟิลด์

source: Snapshot ID copied
th_th: คัดลอก Snapshot ID แล้ว

source: Data revision
th_th: การปรับปรุงข้อมูล

source: Model
th_th: โมเดล

source: status
th_th: สถานะ

source: Worker category
th_th: หมวดหมู่พนักงาน

source: The snapshot was successfully created.
th_th: สร้างสแนปช็อตสำเร็จแล้ว

source: Snapshot details
th_th: รายละเอียด Snapshot

source: Download logs
th_th: ดาวน์โหลดบันทึกการทำงาน

source: Search by snapshot name
th_th: ค้นหาตามชื่อสแนปชอต

source: You are about to change the data model. This action will clear <strong>previously selected worker categories</strong>, since they depend on the chosen data model.
th_th: คุณกำลังจะเปลี่ยนแบบจำลองข้อมูล การดำเนินการนี้จะล้าง <strong>หมวดหมู่พนักงานที่เลือกไว้ก่อนหน้านี้</strong> เนื่องจากหมวดหมู่เหล่านี้ขึ้นอยู่กับแบบจำลองข้อมูลที่เลือก

source: Are you sure you want to continue?
th_th: คุณแน่ใจหรือว่าต้องการดำเนินการต่อ?

source: Data model edition
th_th: รุ่นของ Data Modeler

source: Define the data model, the effective date and the population
th_th: กำหนดแบบจำลองข้อมูล วันที่มีผลบังคับใช้ และกลุ่มพนักงาน

source: Snapshot configuration
th_th: การกำหนดค่าภาพรวม

source: Define the snapshot field name and description
th_th: กำหนดชื่อและคำอธิบายของฟิลด์สแนปช็อต

source: The data model is required.
th_th: จำเป็นต้องมี data model

source: Select the field to include for worker category in this snapshot
th_th: เลือกฟิลด์ที่จะรวมสำหรับหมวดหมู่พนักงานในสแนปชอตนี้

source: Add feature to snapshot
th_th: เพิ่มฟีเจอร์ไปยังสแนปช็อต

source: Define the worker category you want to use in this snapshot
th_th: กำหนดประเภทพนักงานที่คุณต้องการใช้ในสแนปชอตนี้

source: Use worker category configuration
th_th: ใช้การกำหนดค่าประเภทพนักงาน

source: The order of the fields determines the output value of this concatenated field.
th_th: ลำดับของฟิลด์จะเป็นตัวกำหนดค่าผลลัพธ์ของฟิลด์ที่เชื่อมต่อกันนี้

source: Concatenated fields
th_th: ฟิลด์แบบต่อเนื่องกัน
